{
  "ui": {
    "navigation": [
      {
        "label": "Home",
        "href": "/"
      },
      {
        "label": "Experience",
        "href": "/experience"
      },
      {
        "label": "Projects",
        "href": "/projects"
      },
      {
        "label": "Notes",
        "href": "/notes"
      }
    ],
    "language": {
      "selectLanguage": {
        "title": "Select Language"
      }
    }
  },
  "sections": {
    "profile": {
      "welcome": "Hey 👋🏽",
      "subtitle": "Web Developer Creating Interactive and Functional Web Experiences."
    },
    "experience": {
      "title": "Experience",
      "items": [
        {
          "role": "Frontend Developer",
          "description": "Provides software to veterinary offices to streamline processes and increase efficiency.",
          "company": "Pawtrics Software LLC | Florida, USA",
          "datetime": "May 2023 - Apr 2024",
          "responsibilities": [
            "Design and development of user interface components using Next.js, React, and MUI.",
            "Data integration and management with PostgreSQL (via Supabase).",
            "Implementation of MaterialUI for consistent design throughout the project.",
            "Development of CRUD operations and data table management.",
            "Code management with Git and GitHub."
          ],
          "techStack": [
            "TypeScript",
            "Next.js",
            "React",
            "React Hook Form",
            "SWR",
            "MaterialUI",
            "PostgreSQL",
            "Supabase",
            "Git",
            "GitHub"
          ]
        }
      ]
    },
    "testimonies": {
      "title": "Some Testimonies",
      "description": "Would you like to know what my colleagues said about me?",
      "items": [
        {
          "body": "I had the privilege of working with Ignacio at Pawtrics Software, where he demonstrated a strong aptitude for learning and applying React web development skills. Ignacio has an impressive understanding of web technologies and consistently sought to enhance his coding skill set. His proactive attitude and ability to contribute effectively made him a valuable team member. I highly recommend Ignacio to any team looking for a developer with a dedication to quality and growth.",
          "name": "Kiefer Aland",
          "role": "Software Developer",
          "profile": "https://www.linkedin.com/in/kieferaland/"
        },
        {
          "body": "Working with Ignacio has been a great experience from day one. He is a very complete developer, with a great emphasis on details and a great ability to solve problems that may arise. He is also a very good coworker, always helping others, either by taking the time to explain concepts that you do not understand or by contributing his vision to the ideas that are being developed.",
          "name": "Manuel Zarraga",
          "role": "Fullstack Developer",
          "profile": "https://www.linkedin.com/in/manuel-zarraga/"
        },
        {
          "body": "Having worked with Ignacio for about a year I have seen his growth as a developer. He is someone who will go above and beyond, communicating very well with the team. He also is great at working with his peers in group coding sessions and ensuring there is consistency and quality in the code base. I would recommend him to someone looking to grow their development team.",
          "name": "Joseph Pisani",
          "role": "IT Software Support",
          "profile": "https://www.linkedin.com/in/josephpisani/"
        },
        {
          "body": "Ignacio is an exceptional Front-End Developer with a unique combination of technical expertise, positive attitude, and a strong work ethic. He is a highly motivated and results-oriented individual who consistently produces high-quality work. I have no doubt that Ignacio would be a valuable asset to your team, not only for his technical skills but also for his collaborative and helpful nature.",
          "name": "Zachary Roosen",
          "role": "Senior IT System Analyst",
          "profile": "https://www.linkedin.com/in/zroosen/"
        },
        {
          "body": "In the time I've known Ignacio, he's transformed into an outstanding developer. He's not one to settle for mediocrity; instead, he consistently pushes himself to exceed expectations. What distinguishes Ignacio is his engaging nature and relentless pursuit of learning. He approaches every task with humility and a strong work ethic, always striving to expand his knowledge and skills. His dedication ensures a seamless collaboration within the team. If you're seeking a developer committed to continual improvement and fostering teamwork, Ignacio is the ideal choice.",
          "name": "Pia Walcott",
          "role": "Software Engineer",
          "profile": "https://www.linkedin.com/in/pia-walcott/"
        }
      ]
    }
  },
  "pages": {
    "about": {
      "title": "About Me",
      "greeting": "I'm Ignacio Figueroa, Web Developer specializing in <span>Frontend Development</span>. I craft digital experiences that forge meaningful connections between technology and users.",
      "intro": "I leverage <span>React</span> (TypeScript, Next.js) to build <span>intuitive solutions</span> that deliver tangible business value. Driven by challenging projects, I'm currently expanding into Backend Development (Node.js, Express.js, Nest.js) to master the full technology stack. I'm committed to <span>continuous growth</span> and developing projects that make a <span>real difference</span>.",
      "collaboration": "I thrive in diverse teams, creating innovative products that drive meaningful outcomes. I actively seek opportunities that push my boundaries and contribute to advancing the <span>tech landscape</span>."
    },
    "notes": {
      "title": "Notes",
      "description": "A curated collection of my personal insights, tips, quick posts, and code snippets that I frequently use across my projects."
    },
    "projects": {
      "title": "Projects",
      "items": [
        {
          "name": "Web Society Project",
          "description": "Discover the latest web trends, refine your web development skills, and explore innovative resources. Take on new challenges that propel your career to success.",
          "technologies": [
            "TypeScript",
            "Next.js",
            "React",
            "Tailwind",
            "Velite",
            "shadcn/ui",
            "Nest",
            "PostgreSQL"
          ],
          "code": "https://github.com/figueroaignacio/websociety",
          "site": "https://websociety.vercel.app/en"
        },
        {
          "name": "AspenUI",
          "description": "Enhance your workflow with pre-built, fully customizable, open-source components ready to deploy.",
          "technologies": [
            "TypeScript",
            "Next.js",
            "React",
            "Tailwind",
            "Velite"
          ],
          "code": "https://github.com/figueroaignacio/aspen-ui",
          "site": "https://aspen-ui.vercel.app/en"
        }
      ]
    }
  },
  "components": {
    "experienceCard": {
      "responsibilities": {
        "label": "Main Responsibilities"
      },
      "techStack": {
        "label": "Tech Stack"
      }
    },
    "myStack": {
      "title": "Mi stack"
    },
    "footer": {
      "description": "Web developer specialized in Frontend Development and user interface design, expanding knowledge in Backend Development to build modern and efficient solutions."
    },
    "callToAction": {
      "title": "Do you have a project in mind?",
      "subtitle": "Reach me and let's work together.",
      "link": "Send Me an Email"
    }
  },
  "siteConfig": {
    "home": {
      "title": "Ignacio Figueroa - Web Developer",
      "description": "Hi, I’m Ignacio Figueroa, a web developer passionate about building modern and functional experiences. Explore my portfolio and let’s connect to collaborate on innovative projects."
    },
    "about": {
      "title": "Ignacio Figueroa - About Me",
      "description": "I’m Ignacio Figueroa, a web developer dedicated to excellence and innovation. Here you can learn more about my journey, skills, and approach to web development."
    },
    "projects": {
      "title": "Ignacio Figueroa - Projects",
      "description": "Here are some of the projects I’ve worked on, blending modern design, functionality, and cutting-edge technologies. Explore them and see how I can help bring your ideas to life."
    },
    "notes": {
      "title": "Ignacio Figueroa - Notes",
      "description": "In this section, I share my thoughts, lessons learned, and useful resources about web development and tech trends."
    },
    "experience": {
      "title": "Ignacio Figueroa - Experience",
      "description": "In this section, I share my work experiences"
    }
  }
}
